Hướng dịch vụ/Đề thi/Huong dich vu/DeSo1.xml

<?xml version='1.0' encoding='UTF-8'?><!-- Published by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.2-hudson-740-. --><!-- Generated by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.2-hudson-740-. -->
<definitions
        xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
        xmlns:tns="http://webService/" xmlns:xsd="http://www.w3.org/2001/XMLSchema"
        xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://webService/" name="DeSo1ImplService">
    <types/>
    <message name="getName">
        <part name="id" type="xsd:int"/>
    </message>
    <message name="getNameResponse">
        <part name="return" type="xsd:string"/>
    </message>
    <message name="isCheck">
        <part name="id" type="xsd:int"/>
        <part name="name" type="xsd:string"/>
    </message>
    <message name="isCheckResponse">
        <part name="return" type="xsd:boolean"/>
    </message>
    <portType name="DeSo1">
        <operation name="getName">
            <input wsam:Action="http://webService/DeSo1/getNameRequest" message="tns:getName"/>
            <output wsam:Action="http://webService/DeSo1/getNameResponse" message="tns:getNameResponse"/>
        </operation>
        <operation name="isCheck" parameterOrder="id name">
            <input wsam:Action="http://webService/DeSo1/isCheckRequest" message="tns:isCheck"/>
            <output wsam:Action="http://webService/DeSo1/isCheckResponse" message="tns:isCheckResponse"/>
        </operation>
    </portType>
    <binding name="DeSo1ImplPortBinding" type="tns:DeSo1">
        <soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="rpc"/>
        <operation name="getName">
            <soap:operation soapAction=""/>
            <input>
                <soap:body use="literal" namespace="http://webService/"/>
            </input>
            <output>
                <soap:body use="literal" namespace="http://webService/"/>
            </output>
        </operation>
        <operation name="isCheck">
            <soap:operation soapAction=""/>
            <input>
                <soap:body use="literal" namespace="http://webService/"/>
            </input>
            <output>
                <soap:body use="literal" namespace="http://webService/"/>
            </output>
        </operation>
    </binding>
    <service name="DeSo1ImplService">
        <port name="DeSo1ImplPort" binding="tns:DeSo1ImplPortBinding">
            <soap:address location="http://localhost:8080/OnThi/DeSo1Impl"/>
        </port>
    </service>
</definitions>